{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "recurrent_constraint": null, "name": "lstm_1", "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_regularizer": null, "units": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_activation": "hard_sigmoid", "implementation": 1, "return_state": false, "bias_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "trainable": true, "activation": "tanh", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.05000000074505806}}, "unroll": false, "batch_input_shape": [null, 2048, 1], "recurrent_dropout": 0.15, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "stateful": false, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.2, "seed": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.1818181872367859}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "recurrent_constraint": null, "name": "lstm_2", "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "recurrent_activation": "hard_sigmoid", "implementation": 1, "return_state": false, "bias_regularizer": null, "return_sequences": true, "go_backwards": false, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Attention", "config": {"trainable": true, "name": "attention_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "units": 4, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null}}], "keras_version": "2.2.0"}