{"keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"name": "lstm_13", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "return_state": false, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "recurrent_regularizer": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.25, "stateful": false, "recurrent_dropout": 0.25, "go_backwards": false, "trainable": true, "units": 128, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, "dtype": "float32", "trainable": true, "batch_input_shape": [null, 8, 256], "merge_mode": "concat", "name": "bidirectional_13"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_14", "layer": {"class_name": "LSTM", "config": {"name": "lstm_14", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "return_state": false, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "recurrent_regularizer": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.25, "stateful": false, "recurrent_dropout": 0.25, "go_backwards": false, "trainable": true, "units": 32, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, "trainable": true, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_15", "layer": {"class_name": "LSTM", "config": {"name": "lstm_15", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "return_state": false, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "recurrent_regularizer": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.25, "stateful": false, "recurrent_dropout": 0.25, "go_backwards": false, "trainable": true, "units": 8, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, "trainable": true, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 4, "kernel_constraint": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}]}